def add_purchase(item):
    cart = []
    cart.append(item)
    return cart

""" Эта ошибка возникала, так как функция определяется при первом ее вызове и список на первого и второго юзера был одинаковым. Если же я как сейчас буду определять список каждый раз заново (а при этом список юзера1 не будет обнуляться, так как функция возвращает ему значение из локальной переменной), то функция будет каждый раз создавать новый список, добавлять туда нужные значения и возвращать ожидаемый результат юзеру """

